In [39]:
import pandas as pd
import numpy as np
df = pd.read_csv(r'C:\Users\Crypto.gunner\Desktop\CODING\DevelHope\Python\CP 3\Pandas\2013_NYC_Flights_Data.csv')

#### In the flights table from the nycflights13 database, select all columns between year and day (inclusive), without referring to column numbers explicitly (the code should work if we randomly rearrange the columns too). Then select all columns except those between year and day (inclusive).

In [9]:
df[['year', 'month', 'day']].head(1)

   year  month  day
0  2013      1    1

In [14]:
df[df.columns.difference(['year', 'month', 'day'])].head(1)

,Unnamed: 0,air_time,arr_delay,arr_time,carrier,dep_delay,dep_time,dest,distance,flight,hour,minute,origin,sched_arr_time,sched_dep_time,tailnum,time_hour
0,1,227.0,11.0,830.0,UA,2.0,517.0,IAH,1400,1545,5,15,EWR,819,515,N14228,2013-01-01 05:00:00

#### In tips, select data on male customers where total bill was in [10, 20].

In [17]:
filepath = 'https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv'
df = pd.read_csv(filepath)
df.head(1)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2

In [25]:
df.loc[((df.total_bill>10) & (df.total_bill<20)) & (df.sex=='Male')].head(1)

   total_bill   tip   sex smoker  day    time  size
1       10.34  1.66  Male     No  Sun  Dinner     3

#### In tips, select data from Saturday and Sunday with tip > $5.

In [29]:
df.loc[((df.day=='Sun')|(df.day=='Sat'))&(df.tip>5)].head(1)

    total_bill   tip   sex smoker  day    time  size
23       39.42  7.58  Male     No  Sat  Dinner     4

#### In winequality-all, leave out only white wines. Partition the resulting data frame randomly into two data frames: wines_train (80% of the rows) and wines_test (remaining 20%).

In [30]:
filepath = 'https://raw.githubusercontent.com/gagolews/teaching-data/master/other/wine_quality_all.csv'
df = pd.read_csv(filepath, comment="#")
df.head(1)

,fixed.acidity,volatile.acidity,citric.acid,residual.sugar,chlorides,free.sulfur.dioxide,total.sulfur.dioxide,density,pH,sulphates,alcohol,response,color
0,7.4,0.7,0.0,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5,red

In [35]:
df = df.loc[df.color != 'white']
df1 = df.sample(frac = 0.8)
df2 = df.sample(frac = 0.2)
len(df) == len(df1) + len(df2)

True

#### Given fueleconomy::vehicles, convert the values in cty (city-) and hwy (highway-fuel economy – given in mpg) to l/100 km. Then add new columns z_cty and z_hwy, that give z-scores of cty and hwy (i.e., standardize these columns). Moreover, add two other columns z_cty_rel and z_hwy_rel, which denote the corresponding z-scores relative to (grouped by) class.

In [37]:
df = pd.read_csv(r'C:\Users\Crypto.gunner\Desktop\CODING\DevelHope\Python\CP 3\Pandas\database.csv', low_memory=False)
df.head(1)

,Vehicle ID,Year,Make,Model,Class,Drive,Transmission,Transmission Descriptor,Engine Index,Engine Descriptor,...,Hours to Charge (AC 240V),Composite City MPG,Composite Highway MPG,Composite Combined MPG,Range (FT1),City Range (FT1),Highway Range (FT1),Range (FT2),City Range (FT2),Highway Range (FT2)
0,26587,1984,Alfa Romeo,GT V6 2.5,Minicompact Cars,NaN,Manual 5-Speed,NaN,9001,(FFS),...,0.0,0,0,0,0,0.0,0.0,NaN,0.0,0.0

In [ ]:
#blank

#### ASSIGNMENT LIVE CODING 
I want to calculate the percentage of sales per office in a given state (total of all percentages in each state is 100%).

In [47]:
df = pd.DataFrame({'state': ['CA', 'WA', 'CO', 'AZ'] * 3,
                   'office_id': list(range(1, 7)) * 2,
                   'sales': [np.random.randint(100000, 999999)
                             for _ in range(12)]})
df.sort_values(by='state')

   state  office_id   sales
3     AZ          4  147932
7     AZ          2  301689
11    AZ          6  520834
0     CA          1  716702
4     CA          5  370722
8     CA          3  465056
2     CO          3  152108
6     CO          1  757597
10    CO          5  849281
1     WA          2  695100
5     WA          6  949350
9     WA          4  486609

In [65]:
df['sales'] / df.groupby('state')['sales'].transform('sum')

0     0.461650
1     0.326176
2     0.086475
3     0.152436
4     0.238793
5     0.445483
6     0.430701
7     0.310874
8     0.299557
9     0.228341
10    0.482824
11    0.536691
Name: sales, dtype: float64